[
  {
    "name": "Gallery",
    "id": "gallery",
    "excerpt": "An introduction to Object-Oriented PHP, by Edwin Diaz, available on Udemy.",
    "description": "During my time refining my object-oriented programming skills, I decided to follow along with a project course, in which I followed along in creating a copy of Spotify 2017, a music streaming service. I wanted to create a service that would allow users to create their own playlists and listen to their music.\n\n To create this project, I used PHP, MySQL, CSS, JavaScript and AJAX. I used PHP to create the backend of the website, which would handle the user authentication and the database queries. I used MySQL to store the data for the website, which would store the user information, the songs and the playlists. I used CSS to style the website, which would allow the website to look almost identical to that which I was replicating, with minor changes for personal styling choices. I used JavaScript to create the front-end of the website, which would allow the user to interact with the website. I used AJAX to create the asynchronous requests to the server, which would allow the website to be more responsive.",
    "staticImage": "/src/assets/projects/gallery/home.png",
    "animatedImage": "/src/assets/projects/gallery/admin.gif",
    "tools" : ["PHP", "CSS", "JavaScript", "MySQL"],
    "enabled": true
  },
  {
    "name": "Amplify",
    "id": "amplify",
    "excerpt": "A follow along project replicating Spotify 2017, by Reece Kenney, available on Udemy.",
    "description": "",
    "staticImage": "/src/assets/projects/amplify/home.png",
    "animatedImage": "/src/assets/projects/amplify/preview.gif",
    "tools" : ["PHP", "CSS", "JavaScript", "MySQL", "XML"],
    "enabled": true
  },
  {
    "name": "Blog",
    "id": "blog",
    "excerpt": "An ongoing development into designing a blog website while utilizing Laravel.",
    "description": "",
    "staticImage": "/src/assets/projects/blog/admin.png",
    "animatedImage": "/src/assets/projects/blog/admin.PNG",
    "tools" : ["Laravel", "MySQL", "TailwindCSS 3"],
    "enabled": true
  },
  {
    "name": "IGDB",
    "id": "igdb",
    "excerpt": "An ongoing development into creating a video game aggregator using a 3rd party API in a project.",
    "description": "",
    "staticImage": "/src/assets/projects/igdb/borderlands.png",
    "animatedImage": "/src/assets/projects/igdb/preview.gif",
    "tools" : ["Laravel", "IGDB API(4.0)", "TailwindCSS 3"],
    "enabled": true
  },
  {
    "name": "Parallax",
    "id": "parallax",
    "excerpt": "A look into Parallax Scrolling, an effect which can look great when utilised correctly.",
    "description": "",
    "staticImage": "/src/assets/projects/parallax/parallax.png",
    "animatedImage": "/src/assets/projects/parallax/preview.gif",
    "tools" : ["HTML", "JavaScript", "CSS"],
    "enabled": true
  }
]